# GetApplicableResolutionTypes Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinition..::..GetApplicableResolutionTypes Method
FailureDefinition Class See Also
---
Retrieves a list of resolution types applicable to the failure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IList<FailureResolutionType> GetApplicableResolutionTypes()
```

Visual Basic
---
```text
Public Function GetApplicableResolutionTypes As IList(Of FailureResolutionType)
```

Visual C++
---
```text
public:
IList<FailureResolutionType>^ GetApplicableResolutionTypes()
```

# ### Return Value
The list of resolution types applicable to the failure.
# See Also
FailureDefinition Class
Autodesk.Revit.DB Namespace